# AddInId Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInId Constructor
AddInId Class See Also
---
creates an AddInId object with a given GUID
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AddInId(
	Guid val
)
```

Visual Basic
---
```text
Public Sub New ( _
	val As Guid _
)
```

Visual C++
---
```text
public:
AddInId(
	Guid val
)
```

# ### Parameters
val
    Type: System..::..Guid GUID value
# See Also
AddInId Class
Autodesk.Revit.DB Namespace